In [1]:
courses <- c("Java", "R", "SQL", "Python", "Java", 
             "Python", "JavaScript", "SQL", "JavaScript", "R", 
             "JavaScript", "R", "Java", "Python", "Java", "R", "SQL")

courses

 [1] "Java"       "R"          "SQL"        "Python"     "Java"
 [6] "Python"     "JavaScript" "SQL"        "JavaScript" "R"
[11] "JavaScript" "R"          "Java"       "Python"     "Java"
[16] "R"          "SQL"

In [2]:
courses.table <- table(courses)

courses.table

courses
      Java JavaScript     Python          R        SQL
         4          3          3          4          3

In [3]:
class(courses.table)

[1] "table"

In [4]:
gender <- c("m", "f", "m", "m", "f", "f", "m", "f", "f", 
            "f", "m", "m", "f", "m", "f", "f", "m")

gender

 [1] "m" "f" "m" "m" "f" "f" "m" "f" "f" "f" "m" "m" "f" "m" "f" "f" "m"

In [5]:
gender.table <- table(gender)

gender.table

gender
f m
9 8

In [6]:
course.gender.table <- table(courses, gender)

course.gender.table

            gender
courses      f m
  Java       3 1
  JavaScript 1 2
  Python     1 2
  R          3 1
  SQL        1 2

In [7]:
employee.data <- data.frame(id = 1001:1007,
                            
                            name = c("Amanda", "Isaac", "Philip", 
                                     "Felicia", "Jason", "George", "Lily"),
                            
                            department = factor(c("Test Engineering", "Test Engineering", 
                                                  "Engineering", "Engineering",
                                                  "Sales", "HR", "Operations")),
                            
                            gender = factor(c("F", "M", "M", "F", "M", "M", "F")),
                            
                            type = factor(c("Fulltime", "Fulltime", "Contract", 
                                            "Contract", "Parttime", "Parttime", "Fulltime"), 
                                          levels=c("Fulltime", "Contract", "Parttime")),
                            
                            salary = c(135000, 28000, 40000, 166000, 135000, 40000, 50000),
                            
                            stringsAsFactors = FALSE)

employee.data

  id   name    department       gender type     salary
1 1001 Amanda  Test Engineering F      Fulltime 135000
2 1002 Isaac   Test Engineering M      Fulltime  28000
3 1003 Philip  Engineering      M      Contract  40000
4 1004 Felicia Engineering      F      Contract 166000
5 1005 Jason   Sales            M      Parttime 135000
6 1006 George  HR               M      Parttime  40000
7 1007 Lily    Operations       F      Fulltime  50000

In [8]:
dept.type.table <- table(employee.data$department, employee.data$type)

dept.type.table

                   Fulltime Contract Parttime
  Engineering             0        2        0
  HR                      0        0        1
  Operations              1        0        0
  Sales                   0        0        1
  Test Engineering        2        0        0

In [9]:
gender.dept.table <- table(employee.data$gender, employee.data$department)

gender.dept.table

    Engineering HR Operations Sales Test Engineering
  F           1  0          1     0                1
  M           1  1          0     1                1

In [10]:
gender.dept.type.table <- table(employee.data$gender, 
                                employee.data$department,
                                employee.data$type)

gender.dept.type.table

, ,  = Fulltime


    Engineering HR Operations Sales Test Engineering
  F           0  0          1     0                1
  M           0  0          0     0                1

, ,  = Contract


    Engineering HR Operations Sales Test Engineering
  F           1  0          0     0                0
  M           1  0          0     0                0

, ,  = Parttime


    Engineering HR Operations Sales Test Engineering
  F           0  0          0     0                0
  M           0  1          0     1                0

In [11]:
gender.type.table <- table(employee.data$gender, employee.data$type)

gender.type.table

    Fulltime Contract Parttime
  F        2        1        0
  M        1        1        2

In [12]:
addmargins(gender.type.table)

      Fulltime Contract Parttime Sum
  F   2        1        0        3
  M   1        1        2        4
  Sum 3        2        2        7

In [13]:
prop.table(gender.type.table)

     Fulltime  Contract  Parttime
  F 0.2857143 0.1428571 0.0000000
  M 0.1428571 0.1428571 0.2857143